final-guide.org
#+SETUPFILE: setup.org
#+TITLE: Final guide

Answers on the bottom. Also, you can *bring a notecard* (5in x 7in
max) with notes or whatnot.

* Multi-agent systems

What are two principles for designing agent-based simulations?

** Ant intelligence

Which of the following features are in the "ant brood sorting" model?

  - Scent-following
  - Random walks
  - Always pick up an object if ant finds one
  - Decide stochastically to drop an object if holding one
  - Drop the object only when encountering another object (if holding
    an object)
  - Communicate directly with other ants

(The question on the Final will ask about ant transport that you read
for Homework 7.)

Why is it important that the chemical ants leave behind when they are
carrying food slowly evaporates?

** NetLogo

What is a "turtle" in NetLogo?

What is a "patch" in NetLogo?

** Prisoner's dilemma

True or false? "Defecting" means confessing to the crime so that you
get off the hook but your partner goes to jail.

Describe the "Jesus" strategy.

Describe the "Lucifer" strategy.

Describe the "Unforgiving" strategy.

Describe the "Tit-for-tat" a.k.a. "Moses" strategy. What is the first
choice in this strategy? What are all future choices?

Which of these three strategies generally performed best across random
scenarios in the iterated prisoner's dilemma?

If two "Tit-for-tat" strategies face each other in the iterated
prisoner's dilemma, we will see behavior equivalent to which
non-Tit-for-tat strategy or strategies facing each other?

* Learning

Describe the difference between "supervised" and "unsupervised"
learning.

** k-means clustering

k-means clustering is an unsupervised or supervised learning strategy?

What does the choice of $k$ represent?

** k-nearest neighbor

What does k-nearest neighbor allow us to do with a new, unknown data
point?

k-nearest neighbor is an unsupervised or supervised learning strategy?

What does the choice of $k$ represent?

What problem may a very small value of $k$ cause?

What problem may a very large value of $k$ cause?

Is there one value for $k$ that works best for nearly all data sets?
If so, what is it?

Give one benefit of k-nearest neighbor learning.

Give one drawback of k-nearest neighbor learning.

** Document classification

What is the goal of document classification?

Define true positive (TP). Define false positive (FP). Define false
negative (FN). Define precision (in terms of TP and/or FP and/or
FN). Define recall (in terms of TP and/or FP and/or FN). Define
F-score (in terms of precision and/or recall).

Suppose we make our classification engine more cautious; that is, it
is less likely overall to predict any category. Does precision go up
or down or remain unchanged? Does recall go up or down or remain
unchanged?

If the true categories for a document are [Applications, Robots,
Interfaces, Speech] and the predicted categories are [Applications,
Games, Speech], what are the true positive, false positive, and false
negative counts?

If the true categories for document 1 are [Applications, Robots,
Interfaces, Speech], for document 2 are [Games], for document 3 are
[Ethics, Philosophy, Robots], and for document 4 are [Applications,
Vision, ScienceFiction], then what are the precision, recall, and
f-score if the predicted categories for document 1 are [Applications,
Games, Speech], for document 2 are [Games], for document 3 are
[MachineLearning, Vision], and for document 4 are [ScienceFiction]?

Give a possible result of stemming each of the following words:
"linguistic," "dog," "jumping," "philosophy."

Describe a "binary feature vector" for a text document.

Why do you suppose tf-idf feature vectors perform better (in terms of
F-score) than, say, frequency count feature vectors?

A common word (most documents have many occurrences of this word)
would have a high or low tf-idf score?

What is a centroid (in terms of document vectors)?

What is one way a centroid approach to classification is better than
k-nearest neighbor?

** Probability and Bayesian methods

Describe what $P(A)$ means (in words).

Describe what $P(A,B)$ means (in words).

Describe what $P(A|B)$ means (in words).

If events $A$ and $B$ are independent, and $P(A) = 0.25$, $P(B) =
0.10$, what is $P(A,B)$? What is $P(B,A)$?

Write Bayes' theorem.

Suppose I know that $P(B|A)=0.1, P(A)=0.9, P(B)=0.25$, what is
$P(A|B)$?

What is the outcome of computing $\arg\max X (P(x))$ where $X$ is an
event? (If $\arg\max X (P(X))$ was a function, what would the output
of the function be?) Describe in English.

Suppose I know that $P(B|A)=0.1, P(A)=0.9, P(B|C)=0.2, P(C)=0.8$, what
is $\arg\max X (P(X|B))$?

As described in the naïve Bayesian classification notes, what does
$d_i$ represent for some word $i$? What does $d_{ci}$ represent for
some word $i$ and category $c$?

Why do we use logarithms for naïve Bayesian classification
calculations?

What is the outcome of computing $\arg\max x P(x)$ where $x$ is an
event? (If $\arg\max x P(x)$ was a function, what would the output of
the function be?) Describe in English.

Give one benefit of naïve Bayesian classification (as compared to
other classification methods like k-nearest neighbor).

Give one drawback of naïve Bayesian classification (as compared to
other classification methods like support vector machines).

* The "Chinese room" argument

What is the essential goal of "strong AI?"

What is the most critical assumption in the Chinese room argument?

If you believe the Chinese room argument, can you also (reasonably)
believe that passing the Turing test gives proof that a machine
possesses a mind (i.e., can be said to truly understand things)?

* Answers

