final-guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Final guide</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Final guide"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-11 11:37:06 EST"/>
<meta name="author" content="Joshua Eckroth"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="css/worg.css" type="text/css" media="screen" />
</head>
<body>

<div id="preamble">
<a href="index.html">Home</a> &nbsp; &nbsp;
          <!-- Plupper Button -->
          <div id="plupperButton" style="display: inline;"></div>
          <!-- End of Plupper Button Code -->

</div>

<div id="content">
<h1 class="title">Final guide</h1>

<p>Answers on the bottom. Also, you can <b>bring a notecard</b> (5in x 7in
max) with notes or whatnot.
</p>

<div id="table-of-contents">
<h2>TOC</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Multi-agent systems</a>
<ul>
<li><a href="#sec-1-1">Ant intelligence</a></li>
<li><a href="#sec-1-2">NetLogo</a></li>
<li><a href="#sec-1-3">Prisoner&rsquo;s dilemma</a></li>
</ul>
</li>
<li><a href="#sec-2">Learning</a>
<ul>
<li><a href="#sec-2-1">k-means clustering</a></li>
<li><a href="#sec-2-2">k-nearest neighbor</a></li>
<li><a href="#sec-2-3">Document classification</a></li>
<li><a href="#sec-2-4">Probability and Bayesian methods</a></li>
</ul>
</li>
<li><a href="#sec-3">The &ldquo;Chinese room&rdquo; argument</a></li>
<li><a href="#sec-4">Answers</a>
<ul>
<li><a href="#sec-4-1">Multi-agent systems</a>
<ul>
<li><a href="#sec-4-1-1">Ant intelligence</a></li>
<li><a href="#sec-4-1-2">NetLogo</a></li>
<li><a href="#sec-4-1-3">Prisoner&rsquo;s dilemma</a></li>
</ul>
</li>
<li><a href="#sec-4-2">Learning</a>
<ul>
<li><a href="#sec-4-2-1">k-means clustering</a></li>
</ul>
</li>
<li><a href="#sec-4-3">k-nearest neighbor</a></li>
<li><a href="#sec-4-4">Document classification</a></li>
<li><a href="#sec-4-5">Probability and Bayesian methods</a></li>
</ul>
</li>
<li><a href="#sec-5">The &ldquo;Chinese room&rdquo; argument</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Multi-agent systems</h2>
<div class="outline-text-2" id="text-1">


<p>
What are two principles for designing agent-based simulations?
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">Ant intelligence</h3>
<div class="outline-text-3" id="text-1-1">


<p>
Which of the following features are in the &ldquo;ant brood sorting&rdquo; model?
</p>
<ul>
<li>Scent-following
</li>
<li>Random walks
</li>
<li>Always pick up an object if ant finds one
</li>
<li>Decide stochastically to drop an object if holding one
</li>
<li>Drop the object only when encountering another object (if holding
    an object)
</li>
<li>Communicate directly with other ants
</li>
</ul>


<p>
(The question on the Final will ask about ant transport that you read
for Homework 7.)
</p>
<p>
Why is it important that the chemical ants leave behind when they are
carrying food slowly evaporates?
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">NetLogo</h3>
<div class="outline-text-3" id="text-1-2">


<p>
What is a &ldquo;turtle&rdquo; in NetLogo?
</p>
<p>
What is a &ldquo;patch&rdquo; in NetLogo?
</p>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3">Prisoner&rsquo;s dilemma</h3>
<div class="outline-text-3" id="text-1-3">


<p>
True or false? &ldquo;Defecting&rdquo; means confessing to the crime so that you
get off the hook but your partner goes to jail.
</p>
<p>
Describe the &ldquo;Jesus&rdquo; strategy.
</p>
<p>
Describe the &ldquo;Lucifer&rdquo; strategy.
</p>
<p>
Describe the &ldquo;Unforgiving&rdquo; strategy.
</p>
<p>
Describe the &ldquo;Tit-for-tat&rdquo; a.k.a. &ldquo;Moses&rdquo; strategy. What is the first
choice in this strategy? What are all future choices?
</p>
<p>
Which of these three strategies generally performed best across random
scenarios in the iterated prisoner&rsquo;s dilemma?
</p>
<p>
If two &ldquo;Tit-for-tat&rdquo; strategies face each other in the iterated
prisoner&rsquo;s dilemma, we will see behavior equivalent to which
non-Tit-for-tat strategy or strategies facing each other?
</p>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Learning</h2>
<div class="outline-text-2" id="text-2">


<p>
Describe the difference between &ldquo;supervised&rdquo; and &ldquo;unsupervised&rdquo;
learning.
</p>

</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">k-means clustering</h3>
<div class="outline-text-3" id="text-2-1">


<p>
k-means clustering is an unsupervised or supervised learning strategy?
</p>
<p>
What does the choice of \(k\) represent?
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">k-nearest neighbor</h3>
<div class="outline-text-3" id="text-2-2">


<p>
What does k-nearest neighbor allow us to do with a new, unknown data
point?
</p>
<p>
k-nearest neighbor is an unsupervised or supervised learning strategy?
</p>
<p>
What does the choice of \(k\) represent?
</p>
<p>
What problem may a very small value of \(k\) cause?
</p>
<p>
What problem may a very large value of \(k\) cause?
</p>
<p>
Is there one value for \(k\) that works best for nearly all data sets?
If so, what is it?
</p>
<p>
Give one benefit of k-nearest neighbor learning.
</p>
<p>
Give one drawback of k-nearest neighbor learning.
</p>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3">Document classification</h3>
<div class="outline-text-3" id="text-2-3">


<p>
What is the goal of document classification?
</p>
<p>
Define true positive (TP). Define false positive (FP). Define false
negative (FN). Define precision (in terms of TP and/or FP and/or
FN). Define recall (in terms of TP and/or FP and/or FN). Define
F-score (in terms of precision and/or recall).
</p>
<p>
Suppose we make our classification engine more cautious; that is, it
is less likely overall to predict any category. Does precision go up
or down or remain unchanged? Does recall go up or down or remain
unchanged?
</p>
<p>
If the true categories for a document are [Applications, Robots,
Interfaces, Speech] and the predicted categories are [Applications,
Games, Speech], what are the true positive, false positive, and false
negative counts?
</p>
<p>
If the true categories for document 1 are [Applications, Robots,
Interfaces, Speech], for document 2 are [Games], for document 3 are
[Ethics, Philosophy, Robots], and for document 4 are [Applications,
Vision, ScienceFiction], then what are the precision, recall, and
f-score if the predicted categories for document 1 are [Applications,
Games, Speech], for document 2 are [Games], for document 3 are
[MachineLearning, Vision], and for document 4 are [ScienceFiction]?
</p>
<p>
Give a possible result of stemming each of the following words:
&ldquo;linguistic,&rdquo; &ldquo;dog,&rdquo; &ldquo;jumping,&rdquo; &ldquo;philosophy.&rdquo;
</p>
<p>
Describe a &ldquo;binary feature vector&rdquo; for a text document.
</p>
<p>
Why do you suppose tf-idf feature vectors perform better (in terms of
F-score) than, say, frequency count feature vectors?
</p>
<p>
A common word (most documents have many occurrences of this word)
would have a high or low tf-idf score?
</p>
<p>
What is a centroid (in terms of document vectors)?
</p>
<p>
What is one way a centroid approach to classification is better than
k-nearest neighbor?
</p>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4">Probability and Bayesian methods</h3>
<div class="outline-text-3" id="text-2-4">


<p>
Describe what \(P(A)\) means (in words).
</p>
<p>
Describe what \(P(A,B)\) means (in words).
</p>
<p>
Describe what \(P(A|B)\) means (in words).
</p>
<p>
If events \(A\) and \(B\) are independent, and \(P(A) = 0.25\), \(P(B) =
0.10\), what is \(P(A,B)\)? What is \(P(B,A)\)?
</p>
<p>
Write Bayes&rsquo; theorem.
</p>
<p>
Suppose I know that \(P(B|A)=0.1, P(A)=0.9, P(B)=0.25\), what is
\(P(A|B)\)?
</p>
<p>
What is the outcome of computing \(\arg\max X (P(x))\) where \(X\) is an
event? (If \(\arg\max X (P(X))\) was a function, what would the output
of the function be?) Describe in English.
</p>
<p>
Suppose I know that \(P(B|A)=0.1, P(A)=0.9, P(B|C)=0.2, P(C)=0.8\), what
is \(\arg\max X (P(X|B))\)?
</p>
<p>
As described in the naïve Bayesian classification notes, what does
\(d_i\) represent for some word \(i\)? What does \(d_{ci}\) represent for
some word \(i\) and category \(c\)?
</p>
<p>
Why do we use logarithms for naïve Bayesian classification
calculations?
</p>
<p>
What is the outcome of computing \(\arg\max x P(x)\) where \(x\) is an
event? (If \(\arg\max x P(x)\) was a function, what would the output of
the function be?) Describe in English.
</p>
<p>
Give one benefit of naïve Bayesian classification (as compared to
other classification methods like k-nearest neighbor).
</p>
<p>
Give one drawback of naïve Bayesian classification (as compared to
other classification methods like support vector machines).
</p>
</div>
</div>

</div>
