final-guide.org
** Multi-agent systems

What are two principles for designing agent-based simulations?

Here are seven:

  1. agents not functions (not functional decomposition) 
  2. keep agents small in size 
  3. keep agents small in time (forgetful) 
  4. keep agents small in scope (local sensing and action) 
  5. decentralizd system control 
  6. support agent diversity 
  7. provide an entropy leak 

*** Ant intelligence

  - *No*: Scent-following
  - *Yes*: Random walks
  - *No*: Always pick up an object if ant finds one
  - *Yes*: Decide stochastically to drop an object if holding one
  - *No*: Drop the object only when encountering another object (if
    holding an object) --- (every time step, regardless of whether
    another object is encountered, determine whether to drop the
    object if holding one)
  - *No*: Communicate directly with other ants

Why is it important that the chemical ants leave behind when they are
carrying food slowly evaporates?

*The chemical must evaporate so that the ants do not continue trying
to walk to a food source that no longer exists. The ants need to
"forget" (one of the principles of agent design).*

*** NetLogo

What is a "turtle" in NetLogo?

*A turtle is a single agent that acts independently of all other
turtles (agents).*

What is a "patch" in NetLogo?

*A patch is a square on the map; the patch can have a color or other
properties like a chemical. Patches do not move but they can have
actions (such as changing one of their properties).*

*** Prisoner's dilemma

True or false? "Defecting" means confessing to the crime so that you
get off the hook but your partner goes to jail. *True*

Describe the "Jesus" strategy. *Always cooperate*

Describe the "Lucifer" strategy. *Always defect*

Describe the "Unforgiving" strategy. *Cooperate until the partner
defects, and then defect forever after.*

Describe the "Tit-for-tat" a.k.a. "Moses" strategy. What is the first
choice in this strategy? *Tit-for-tat does the same action the partner
did in the last time step; it just mirrors the partner. The first
choice (if tit-for-tat goes first) is to cooperate.*

Which of these three strategies generally performed best across random
scenarios in the iterated prisoner's dilemma? *Tit-for-tat*

If two "Tit-for-tat" strategies face each other in the iterated
prisoner's dilemma, we will see behavior equivalent to which
non-Tit-for-tat strategy or strategies facing each other? *Jesus
strategies*

** Learning

Describe the difference between "supervised" and "unsupervised"
learning.

*Supervised learning uses information about the truth when
training. Unsupervised learning does not have the truth (ever) so
obviously cannot use this information.*

*** k-means clustering

k-means clustering is an unsupervised or supervised learning strategy?
*Unsupervised*

What does the choice of $k$ represent? *The number of clusters.*

** k-nearest neighbor

What does k-nearest neighbor allow us to do with a new, unknown data
point? *Determine its category (class, label, tag, etc.).*

k-nearest neighbor is an unsupervised or supervised learning strategy?
*Supervised*

What does the choice of $k$ represent? *The number of neighbors that
get a "vote" during the classification stage.*

What problem may a very small value of $k$ cause? *Noise has too great
an impact. The nearest neighbor will be chosen without considering
the "larger" picture.*

What problem may a very large value of $k$ cause? *The more common
category will be chosen more often than it should.*

Is there one value for $k$ that works best for nearly all data sets?
If so, what is it? *There is not one best value; need to experiment
with different values to find the best for your dataset.*

Give one benefit of k-nearest neighbor learning. *It is a very simple
algorithm and can work quite well in some cases.*

Give one drawback of k-nearest neighbor learning. *It is very slow
because it checks every item in the database. It also requires one
to retain all the training examples in the database.*

