final-guide.html

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">The &ldquo;Chinese room&rdquo; argument</h2>
<div class="outline-text-2" id="text-3">


<p>
What is the essential goal of &ldquo;strong AI?&rdquo;
</p>
<p>
What is the most critical assumption in the Chinese room argument?
</p>
<p>
If you believe the Chinese room argument, can you also (reasonably)
believe that passing the Turing test gives proof that a machine
possesses a mind (i.e., can be said to truly understand things)?
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Answers</h2>
<div class="outline-text-2" id="text-4">



</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">Multi-agent systems</h3>
<div class="outline-text-3" id="text-4-1">


<p>
What are two principles for designing agent-based simulations?
</p>
<p>
Here are seven:
</p>
<ol>
<li>agents not functions (not functional decomposition) 
</li>
<li>keep agents small in size 
</li>
<li>keep agents small in time (forgetful) 
</li>
<li>keep agents small in scope (local sensing and action) 
</li>
<li>decentralizd system control 
</li>
<li>support agent diversity 
</li>
<li>provide an entropy leak 
</li>
</ol>



</div>

<div id="outline-container-4-1-1" class="outline-4">
<h4 id="sec-4-1-1">Ant intelligence</h4>
<div class="outline-text-4" id="text-4-1-1">


<ul>
<li><b>No</b>: Scent-following
</li>
<li><b>Yes</b>: Random walks
</li>
<li><b>No</b>: Always pick up an object if ant finds one
</li>
<li><b>Yes</b>: Decide stochastically to drop an object if holding one
</li>
<li><b>No</b>: Drop the object only when encountering another object (if
    holding an object) &mdash; (every time step, regardless of whether
    another object is encountered, determine whether to drop the
    object if holding one)
</li>
<li><b>No</b>: Communicate directly with other ants
</li>
</ul>


<p>
Why is it important that the chemical ants leave behind when they are
carrying food slowly evaporates?
</p>
<p>
<b>The chemical must evaporate so that the ants do not continue trying to walk to a food source that no longer exists. The ants need to &ldquo;forget&rdquo; (one of the principles of agent design).</b>
</p>
</div>

</div>

<div id="outline-container-4-1-2" class="outline-4">
<h4 id="sec-4-1-2">NetLogo</h4>
<div class="outline-text-4" id="text-4-1-2">


<p>
What is a &ldquo;turtle&rdquo; in NetLogo?
</p>
<p>
<b>A turtle is a single agent that acts independently of all other turtles (agents).</b>
</p>
<p>
What is a &ldquo;patch&rdquo; in NetLogo?
</p>
<p>
<b>A patch is a square on the map; the patch can have a color or other properties like a chemical. Patches do not move but they can have actions (such as changing one of their properties).</b>
</p>
</div>

</div>

<div id="outline-container-4-1-3" class="outline-4">
<h4 id="sec-4-1-3">Prisoner&rsquo;s dilemma</h4>
<div class="outline-text-4" id="text-4-1-3">


<p>
True or false? &ldquo;Defecting&rdquo; means confessing to the crime so that you
get off the hook but your partner goes to jail. <b>True</b>
</p>
<p>
Describe the &ldquo;Jesus&rdquo; strategy. <b>Always cooperate</b>
</p>
<p>
Describe the &ldquo;Lucifer&rdquo; strategy. <b>Always defect</b>
</p>
<p>
Describe the &ldquo;Unforgiving&rdquo; strategy. <b>Cooperate until the partner defects, and then defect forever after.</b>
</p>
<p>
Describe the &ldquo;Tit-for-tat&rdquo; a.k.a. &ldquo;Moses&rdquo; strategy. What is the first
choice in this strategy? <b>Tit-for-tat does the same action the partner did in the last time step; it just mirrors the partner. The first choice (if tit-for-tat goes first) is to cooperate.</b>
</p>
<p>
Which of these three strategies generally performed best across random
scenarios in the iterated prisoner&rsquo;s dilemma? <b>Tit-for-tat</b>
</p>
<p>
If two &ldquo;Tit-for-tat&rdquo; strategies face each other in the iterated
prisoner&rsquo;s dilemma, we will see behavior equivalent to which
non-Tit-for-tat strategy or strategies facing each other? <b>Jesus strategies</b>
</p>
</div>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">Learning</h3>
<div class="outline-text-3" id="text-4-2">


<p>
Describe the difference between &ldquo;supervised&rdquo; and &ldquo;unsupervised&rdquo;
learning.
</p>
<p>
<b>Supervised learning uses information about the truth when training. Unsupervised learning does not have the truth (ever) so obviously cannot use this information.</b>
</p>

</div>

<div id="outline-container-4-2-1" class="outline-4">
<h4 id="sec-4-2-1">k-means clustering</h4>
<div class="outline-text-4" id="text-4-2-1">


<p>
k-means clustering is an unsupervised or supervised learning strategy?
<b>Unsupervised</b>
</p>
<p>
What does the choice of \(k\) represent? <b>The number of clusters.</b>
</p>
</div>
</div>

</div>

<div id="outline-container-4-3" class="outline-3">
<h3 id="sec-4-3">k-nearest neighbor</h3>
<div class="outline-text-3" id="text-4-3">


<p>
What does k-nearest neighbor allow us to do with a new, unknown data
point? <b>Determine its category (class, label, tag, etc.).</b>
</p>
<p>
k-nearest neighbor is an unsupervised or supervised learning strategy?
<b>Supervised</b>
</p>
<p>
What does the choice of \(k\) represent? <b>The number of neighbors that get a &ldquo;vote&rdquo; during the classification stage.</b>
</p>
<p>
What problem may a very small value of \(k\) cause? <b>Noise has too great an impact. The nearest neighbor will be chosen without considering the &ldquo;larger&rdquo; picture.</b>
</p>
<p>
What problem may a very large value of \(k\) cause? <b>The more common category will be chosen more often than it should.</b>
</p>
<p>
Is there one value for \(k\) that works best for nearly all data sets?
If so, what is it? <b>There is not one best value; need to experiment with different values to find the best for your dataset.</b>
</p>
<p>
Give one benefit of k-nearest neighbor learning. <b>It is a very simple algorithm and can work quite well in some cases.</b>
</p>
<p>
Give one drawback of k-nearest neighbor learning. <b>It is very slow because it checks every item in the database. It also requires one to retain all the training examples in the database.</b>
</p>
</div>

</div>
