final-guide.org
** Document classification

What is the goal of document classification? *Determine the category
(class) or categories for a new document.*

Define true positive (TP). Define false positive (FP). Define false
negative (FN). Define precision (in terms of TP and/or FP and/or
FN). Define recall (in terms of TP and/or FP and/or FN). Define
F-score (in terms of precision and/or recall).

*True positive (tp): chosen categories that are true categories.*

*False positive (fp): chosen categories that are not true categories.*

*False negatives (fn): true categories that are not chosen.*

*Precision: $tp/(tp+fp)$.*

*Recall: $tp/(tp+fn)$.*

*F-score: $2 * precision * recall / (precision + recall)$.*

Suppose we make our classification engine more cautious; that is, it
is less likely overall to predict any category. Does precision go up
or down or remain unchanged? Does recall go up or down or remain
unchanged? *Precision goes up because there are fewer $fp$. Recall
goes down because there are more $fn$.*

If the true categories for a document are [Applications, Robots,
Interfaces, Speech] and the predicted categories are [Applications,
Games, Speech], what are the true positive, false positive, and false
negative counts? *TP: 2, FP: 1, FN: 2*

If the true categories for document 1 are [Applications, Robots,
Interfaces, Speech], for document 2 are [Games], for document 3 are
[Ethics, Philosophy, Robots], and for document 4 are [Applications,
Vision, ScienceFiction], then what are the precision, recall, and
f-score if the predicted categories for document 1 are [Applications,
Games, Speech], for document 2 are [Games], for document 3 are
[MachineLearning, Vision], and for document 4 are [ScienceFiction]?

*For doc 1: TP: 2, FP: 1, FN: 2.*

*For doc 2: TP: 1, FP: 0, FN: 0.*

*For doc 3: TP: 0, FP: 2, FN: 3.*

*For doc 4: TP: 1, FP: 0, FN: 2.*

*Sums: TP: 4, FP: 3, FN: 7.*

*Thus, precision: $4/(4+3)=0.57$, recall: $4/(4+7)=0.36$, f-score:
 $2*0.57*0.36/(0.57+0.36)=0.44$.*

Give a possible result of stemming each of the following words:
"linguistic," "dog," "jumping," "philosophy." *Maybe: "linguist" "dog"
"jump" "philos". "Dog" won't be stemmed, for example.*

Describe a "binary feature vector" for a text document. *Each unique
word is a "dimension," and the value for that dimension is 1 or 0. It
is 1 if the word is present in the document, 0 otherwise.*

Why do you suppose tf-idf feature vectors perform better (in terms of
F-score) than, say, frequency count feature vectors? *The
"contribution" of each word is considered rather than its count.  This
matters because some common words, like "the," don't contribute any
information about the document's category. We can detect the
contribution of a word by considering how many other docs have the
same word.*

A common word (most documents have many occurrences of this word)
would have a high or low tf-idf score? *A low tf-idf score.*

What is a centroid (in terms of document vectors)? *A vector that is
the average of the vectors of all documents in some category.*

What is one way a centroid approach to classification is better than
k-nearest neighbor? *Only need to keep the centroids in memory, not
every individual training document.*

** Probability and Bayesian methods

Describe what $P(A)$ means (in words). *The probability that some
event $A$ occurs.*

Describe what $P(A,B)$ means (in words). *The probability that two
events $A$ and $B$ occur together.*

Describe what $P(A|B)$ means (in words). *The probability that some
event $A$ occurs given that we know or are assuming event $B$ also
occurs.*

If events $A$ and $B$ are independent, and $P(A) = 0.25$, $P(B) =
0.10$, what is $P(A,B)$? *$0.25 * 0.10 = 0.025$* What is $P(B,A)$?
*Same.*

Write Bayes' theorem. *$P(B|A) = P(A|B)P(B)/P(A)$ or equivalently
$P(A|B) = P(B|A)P(A)/P(B)$.*

Suppose I know that $P(B|A)=0.1, P(A)=0.9, P(B)=0.25$, what is
$P(A|B)$? *$P(A|B)=0.1*0.9/0.25=0.36$.*

What is the outcome of computing $\arg\max X (P(X))$ where $X$ is an
event? (If $\arg\max X (P(x))$ was a function, what would the output
of the function be?) Describe in English. *The outcome would be an
event, not a probability.*

Suppose I know that $P(B|A)=0.1, P(A)=0.9, P(B|C)=0.2, P(C)=0.8$, what
is $\arg\max X (P(X|B))$? *The answer is $C$ because $P(B|A)P(A) <
P(B|C)P(C)$.*

As described in the naïve Bayesian classification notes, what does
$d_i$ represent for some word $i$? *$d_i$ is the number of documents
(in the whole database) that contain at least one occurrence of word
$i$.* What does $d_{ci}$ represent for some word $i$ and category $c$?
*$d_{ci}$ is the number of documents in category $c$ that contain at
least one occurrence of word $i$.*

Why do we use logarithms for naïve Bayesian classification
calculations? *To avoid "underflow" with our numbers; after
multiplying a lot of probabilities (one probability per word), we get
very small values.*

Give one benefit of naïve Bayesian classification (as compared to
other classification methods like k-nearest neighbor). *It is fast.*

Give one drawback of naïve Bayesian classification (as compared to
other classification methods like support vector machines). *It is not
always highly accurate.*

* The "Chinese room" argument

What is the essential goal of "strong AI?" *Create a true "mind,"
i.e., an intelligent thinking machine. It may even be conscious.*

What is the most critical assumption in the Chinese room argument?
*That the person in the room does not understand Chinese.*

If you believe the Chinese room argument, can you also (reasonably)
believe that passing the Turing test gives proof that a machine
possesses a mind (i.e., can be said to truly understand things)? *No.*

#+INCLUDE: footer.org

