final-guide.html

<div id="outline-container-4-4" class="outline-3">
<h3 id="sec-4-4">Document classification</h3>
<div class="outline-text-3" id="text-4-4">


<p>
What is the goal of document classification? <b>Determine the category (class) or categories for a new document.</b>
</p>
<p>
Define true positive (TP). Define false positive (FP). Define false
negative (FN). Define precision (in terms of TP and/or FP and/or
FN). Define recall (in terms of TP and/or FP and/or FN). Define
F-score (in terms of precision and/or recall).
</p>
<p>
<b>True positive (tp): chosen categories that are true categories.</b>
</p>
<p>
<b>False positive (fp): chosen categories that are not true categories.</b>
</p>
<p>
<b>False negatives (fn): true categories that are not chosen.</b>
</p>
<p>
<b>Precision: \(tp/(tp+fp)\).</b>
</p>
<p>
<b>Recall: \(tp/(tp+fn)\).</b>
</p>
<p>
<b>F-score: \(2 * precision * recall / (precision + recall)\).</b>
</p>
<p>
Suppose we make our classification engine more cautious; that is, it
is less likely overall to predict any category. Does precision go up
or down or remain unchanged? Does recall go up or down or remain
unchanged? <b>Precision goes up because there are fewer \(fp\). Recall goes down because there are more \(fn\).</b>
</p>
<p>
If the true categories for a document are [Applications, Robots,
Interfaces, Speech] and the predicted categories are [Applications,
Games, Speech], what are the true positive, false positive, and false
negative counts? <b>TP: 2, FP: 1, FN: 2</b>
</p>
<p>
If the true categories for document 1 are [Applications, Robots,
Interfaces, Speech], for document 2 are [Games], for document 3 are
[Ethics, Philosophy, Robots], and for document 4 are [Applications,
Vision, ScienceFiction], then what are the precision, recall, and
f-score if the predicted categories for document 1 are [Applications,
Games, Speech], for document 2 are [Games], for document 3 are
[MachineLearning, Vision], and for document 4 are [ScienceFiction]?
</p>
<p>
<b>For doc 1: TP: 2, FP: 1, FN: 2.</b>
</p>
<p>
<b>For doc 2: TP: 1, FP: 0, FN: 0.</b>
</p>
<p>
<b>For doc 3: TP: 0, FP: 2, FN: 3.</b>
</p>
<p>
<b>For doc 4: TP: 1, FP: 0, FN: 2.</b>
</p>
<p>
<b>Sums: TP: 4, FP: 3, FN: 7.</b>
</p>
<p>
<b>Thus, precision: \(4/(4+3)=0.57\), recall: \(4/(4+7)=0.36\), f-score:  \(2*0.57*0.36/(0.57+0.36)=0.44\).</b>
</p>
<p>
Give a possible result of stemming each of the following words:
&ldquo;linguistic,&rdquo; &ldquo;dog,&rdquo; &ldquo;jumping,&rdquo; &ldquo;philosophy.&rdquo; <b>Maybe: &ldquo;linguist&rdquo; &ldquo;dog&rdquo; &ldquo;jump&rdquo; &ldquo;philos&rdquo;. &ldquo;Dog&rdquo; won&rsquo;t be stemmed, for example.</b>
</p>
<p>
Describe a &ldquo;binary feature vector&rdquo; for a text document. <b>Each unique word is a &ldquo;dimension,&rdquo; and the value for that dimension is 1 or 0. It is 1 if the word is present in the document, 0 otherwise.</b>
</p>
<p>
Why do you suppose tf-idf feature vectors perform better (in terms of
F-score) than, say, frequency count feature vectors? <b>The &ldquo;contribution&rdquo; of each word is considered rather than its count.  This matters because some common words, like &ldquo;the,&rdquo; don&rsquo;t contribute any information about the document&rsquo;s category. We can detect the contribution of a word by considering how many other docs have the same word.</b>
</p>
<p>
A common word (most documents have many occurrences of this word)
would have a high or low tf-idf score? <b>A low tf-idf score.</b>
</p>
<p>
What is a centroid (in terms of document vectors)? <b>A vector that is the average of the vectors of all documents in some category.</b>
</p>
<p>
What is one way a centroid approach to classification is better than
k-nearest neighbor? <b>Only need to keep the centroids in memory, not every individual training document.</b>
</p>
</div>

</div>

<div id="outline-container-4-5" class="outline-3">
<h3 id="sec-4-5">Probability and Bayesian methods</h3>
<div class="outline-text-3" id="text-4-5">


<p>
Describe what \(P(A)\) means (in words). <b>The probability that some event \(A\) occurs.</b>
</p>
<p>
Describe what \(P(A,B)\) means (in words). <b>The probability that two events \(A\) and \(B\) occur together.</b>
</p>
<p>
Describe what \(P(A|B)\) means (in words). <b>The probability that some event \(A\) occurs given that we know or are assuming event \(B\) also occurs.</b>
</p>
<p>
If events \(A\) and \(B\) are independent, and \(P(A) = 0.25\), \(P(B) =
0.10\), what is \(P(A,B)\)? <b>$0.25 * 0.10 = 0.025$</b> What is \(P(B,A)\)?
<b>Same.</b>
</p>
<p>
Write Bayes&rsquo; theorem. <b>\(P(B|A) = P(A|B)P(B)/P(A)\) or equivalently \(P(A|B) = P(B|A)P(A)/P(B)\).</b>
</p>
<p>
Suppose I know that \(P(B|A)=0.1, P(A)=0.9, P(B)=0.25\), what is
\(P(A|B)\)? <b>\(P(A|B)=0.1*0.9/0.25=0.36\).</b>
</p>
<p>
What is the outcome of computing \(\arg\max X (P(X))\) where \(X\) is an
event? (If \(\arg\max X (P(x))\) was a function, what would the output
of the function be?) Describe in English. <b>The outcome would be an event, not a probability.</b>
</p>
<p>
Suppose I know that \(P(B|A)=0.1, P(A)=0.9, P(B|C)=0.2, P(C)=0.8\), what
is \(\arg\max X (P(X|B))\)? <b>The answer is \(C\) because \(P(B|A)P(A) &lt; P(B|C)P(C)\).</b>
</p>
<p>
As described in the naïve Bayesian classification notes, what does
\(d_i\) represent for some word \(i\)? <b>\(d_i\) is the number of documents (in the whole database) that contain at least one occurrence of word \(i\).</b> What does \(d_{ci}\) represent for some word \(i\) and category \(c\)?
<b>\(d_{ci}\) is the number of documents in category \(c\) that contain at least one occurrence of word \(i\).</b>
</p>
<p>
Why do we use logarithms for naïve Bayesian classification
calculations? <b>To avoid &ldquo;underflow&rdquo; with our numbers; after multiplying a lot of probabilities (one probability per word), we get very small values.</b>
</p>
<p>
Give one benefit of naïve Bayesian classification (as compared to
other classification methods like k-nearest neighbor). <b>It is fast.</b>
</p>
<p>
Give one drawback of naïve Bayesian classification (as compared to
other classification methods like support vector machines). <b>It is not always highly accurate.</b>
</p>
</div>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">The &ldquo;Chinese room&rdquo; argument</h2>
<div class="outline-text-2" id="text-5">


<p>
What is the essential goal of &ldquo;strong AI?&rdquo; <b>Create a true &ldquo;mind,&rdquo; i.e., an intelligent thinking machine. It may even be conscious.</b>
</p>
<p>
What is the most critical assumption in the Chinese room argument?
<b>That the person in the room does not understand Chinese.</b>
</p>
<p>
If you believe the Chinese room argument, can you also (reasonably)
believe that passing the Turing test gives proof that a machine
possesses a mind (i.e., can be said to truly understand things)? <b>No.</b>
</p>


<div style="font-size: 80%; clear: both;">
<span xmlns:dct="http://purl.org/dc/terms/" href="http://purl.org/dc/dcmitype/Text" property="dct:title" rel="dct:type">CSE 3521 material</span> by <a xmlns:cc="http://creativecommons.org/ns#" href="http://cse3521.artifice.cc" property="cc:attributionName" rel="cc:attributionURL">Joshua Eckroth</a> is licensed under a <a rel="license" href="http://creativecommons.org/licenses/by-sa/3.0/">Creative Commons Attribution-ShareAlike 3.0 Unported License</a>. Source code for this website available at <a href="https://github.com/joshuaeckroth/cse3521-website">GitHub</a>.
</div>

<!-- Plupper Tracking Code -->
<script src="https://www.google.com/jsapi"></script>
<script type="text/javascript"
    src="https://static.plupper.com/js/plupper.js"></script>
<script type="text/javascript">
    plupper.init("joshuaeckroth@plupper.com");
    plupper.enableCobrowsing();
</script>
<!-- End of Plupper Tracking Code -->



</div>
</div>
</div>

</body>
</html>
